// sortic.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>
#include "fun.h"

using namespace std;

int main() {
	int min = 0;
	vector <int> a = { 1, 4, 7, 9,-2, 79,-100 };
	vector <int> b = {};
	vector <int> c = {};
	for () {
	min = itc_min(a);
	while (a[0] != min) {
		itc_ra(a);
	}
	itc_pb(a, b);
	for (int i = 0; i < b.size(); i++) {
		cout << b[i] << " ";
	}
	itc_per(a, c);
}

		for (int j = 0; j < a.size(); j++) {
			cout << endl << a[j] << " ";
		}
	return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
